In [16]:
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats as st
import numpy as np
from pathlib import Path

In [17]:
# add csv file
data_salaries_csv = Path("Resources/salaries.csv")

In [18]:
# read full dataframe
data_salaries_df = pd.read_csv(data_salaries_csv)
data_salaries_df.shape

(7919, 11)

In [19]:
# drop null values (if any)
data_salaries = data_salaries_df.dropna()
data_salaries_df.shape

(7919, 11)

In [22]:
# filter by employment type (get only full-time)
data_salaries_df["employment_type"].value_counts()
# data_salaries_df = data_salaries_df.loc[(data_salaries_df["employment_type"]=="FT")]

FT    7877
Name: employment_type, dtype: int64

In [21]:
# filter by country (get only US & drop redundant columns)
data_salaries_df["company_location"].value_counts()
# data_salaries_df = data_salaries_df.loc[(data_salaries_df["company_location"]=="US")]
# data_salaries_df = data_salaries_df.drop(columns=["salary_currency", "salary_in_usd", 
#                                                   "employee_residence", "company_location"])
# data_salaries_df.head()

US    6748
GB     395
CA     177
ES     106
DE      70
      ...
AM       1
QA       1
HK       1
ZA       1
MT       1
Name: company_location, Length: 70, dtype: int64

In [8]:
# filter by year
data_salaries_2023_df = data_salaries_df.loc[(data_salaries_df["work_year"]==2023)]
data_salaries_2022_df = data_salaries_df.loc[(data_salaries_df["work_year"]==2022)]
data_salaries_2021_df = data_salaries_df.loc[(data_salaries_df["work_year"]==2021)]
data_salaries_2020_df = data_salaries_df.loc[(data_salaries_df["work_year"]==2020)]

In [9]:
# filter by experience level
data_salaries_df["experience_level"].value_counts()
data_salaries_en_df = data_salaries_df.loc[(data_salaries_df["experience_level"]=="EN")]
data_salaries_mi_df = data_salaries_df.loc[(data_salaries_df["experience_level"]=="MI")]
data_salaries_se_df = data_salaries_df.loc[(data_salaries_df["experience_level"]=="SE")]
data_salaries_ex_df = data_salaries_df.loc[(data_salaries_df["experience_level"]=="EX")]

In [10]:
# filter by job title
data_salaries_df["job_title"].value_counts()
data_salaries_da_df = data_salaries_df.loc[(data_salaries_df["job_title"]=="Data Analyst")]
data_salaries_ds_df = data_salaries_df.loc[(data_salaries_df["job_title"]=="Data Scientist")]
data_salaries_de_df = data_salaries_df.loc[(data_salaries_df["job_title"]=="Data Engineer")]
data_salaries_mle_df = data_salaries_df.loc[(data_salaries_df["job_title"]=="Machine Learning Engineer")]

In [11]:
# filter to get only entry level data analysts
data_salaries_da_en_df = data_salaries_da_df.loc[(data_salaries_da_df["experience_level"]=="EN")]
data_salaries_da_en_df

,work_year,experience_level,employment_type,job_title,salary,remote_ratio,company_size
101,2023,EN,FT,Data Analyst,80800,0,M
102,2023,EN,FT,Data Analyst,53800,0,M
1470,2023,EN,FT,Data Analyst,94600,0,M
1471,2023,EN,FT,Data Analyst,86000,0,M
1547,2023,EN,FT,Data Analyst,75000,0,M
...,...,...,...,...,...,...,...
7711,2021,EN,FT,Data Analyst,90000,100,S
7712,2021,EN,FT,Data Analyst,60000,100,S
7728,2021,EN,FT,Data Analyst,80000,100,M
7773,2020,EN,FT,Data Analyst,91000,100,L
7805,2020,EN,FT,Data Analyst,72000,100,L

In [24]:
# find average entry level data analyst salary
data_salaries_da_en_df["salary"].max()
# round(data_salaries_da_en_df["salary"].mean(),2)

150000

In [13]:
# find average entry level data analyst salary by company_size
data_salaries_da_en_df.groupby(["company_size"])["salary"].mean()

company_size
L    73300.000000
M    77321.071429
S    58750.000000
Name: salary, dtype: float64

In [14]:
# filter by remote_ratio
data_salaries_df["remote_ratio"].value_counts()

0      4156
100    2549
50       43
Name: remote_ratio, dtype: int64